### Welcome day 19 of 30 days python

## Python Automation Project -- Data Cleaning app

**Requirements**
Please create a python application that can take datasets and clean the data
- It should ask for datasets path and name
- it should check number of duplicats and remove all the duplicates 
- it should keep a copy of all the duplicates
- it should check for missing values 
- if any column that is numeric it should replace nulls with mean else it should drop that rows
- at end it should save the data as clean data and also return 
- duplicates records, clean_data

In [2]:
import pandas as pd
import numpy as np
data3 = {
        'order_id': [1, 2, 3, 4, 5, 1], 
        'product': ['iPhone 14', 'iMac 15', np.nan, 'Airpods Pro', 'iWatch', 'iPhone 14'],
        'price' : [799, 1299, np.nan, np.nan, 499, 799]
        }

df3 = pd.DataFrame(data3)
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0
5         1    iPhone 14   799.0

In [8]:
df3.duplicated().sum()

np.int64(1)

In [11]:
dup_rec = df3[df3.duplicated()]
dup_rec

   order_id    product  price
5         1  iPhone 14  799.0

In [6]:
df3.drop_duplicates(inplace=True)

In [16]:
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [20]:
df3.isnull().sum().sum()

np.int64(3)

In [21]:
df3.dropna(subset='product')

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [23]:
df3['price'].fillna(df3['price'].mean())

0     799.000000
1    1299.000000
2     865.666667
3     865.666667
4     499.000000
Name: price, dtype: float64

In [24]:
df3.dtypes

order_id      int64
product      object
price       float64
dtype: object

In [26]:
df3['product'].dtype

dtype('O')

In [7]:
columns = df3.columns

In [10]:
for col in columns:
    if df3[col].dtype in (int, float):
        df3[col] = df3[col].fillna(df3[col].mean())
    else:
        df3.dropna(subset=col, inplace=True)  # updating the dataframe

df3

C:\Users\Administrator\AppData\Local\Temp\ipykernel_1412\1549589897.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3[col] = df3[col].fillna(df3[col].mean())
C:\Users\Administrator\AppData\Local\Temp\ipykernel_1412\1549589897.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3.dropna(subset=col, inplace=True)  # updating the dataframe
C:\Users\Administrator\AppData\Local\Temp\ipykernel_1412\1549589897.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3[col] = df3[col].fillna(df3[col].mean())

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
3         4  Airpods Pro   849.0
4         5       iWatch   499.0

In [13]:
import time
import random

num = random.randint(1, 5)
print(f"Please wait.Delaying by {num} sec")
time.sleep(num)

Please wait.Delaying by 2 sec